<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/3_Ranking.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Ranking Functions

## Overview

**Product Analysis Focused**

### ü•Ö Analysis Goals

- What we‚Äôre going to use for this dataset to do X e.g. Use the following in order to explore a dataset on experience and salaries
    - Major topic 1
    - Major topic 2
    - Major topic 3
- The end goal of this is e.g. Identify which jobs meet our expectations of years experience and total salary.

### üìò Concepts Covered

General concepts we‚Äôre going to cover

- Concept 1
- Concept 2
- Concept 3

## Order by & Row Number

### üìù¬†Notes

- Gives a rank to each row.

## Syntax

- `ORDER BY`: Orders rows within each partition for the function.
- `ROW_NUMBER()`: Assigns a unique number to each row within a partition.

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Problem Description

**`FUNCTION` / Concept Covered**

1. Go into specific step / what we‚Äôre going to do. E.g. Use the `=` operator to set a new column to be equal to Experience

In [1]:
import sys
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the ipython-sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

**Simple Example**

In [2]:
%%sql

SELECT 
    productkey,
    ROW_NUMBER() OVER () AS product_rank
FROM sales

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

199873 rows affected.

+------------+--------------+
| productkey | product_rank |
+------------+--------------+
|     48     |      1       |
|    460     |      2       |
|    1730    |      3       |
|    955     |      4       |
|     62     |      5       |
|    1050    |      6       |
|    1608    |      7       |
|     85     |      8       |
|    128     |      9       |
|    2079    |      10      |
+------------+--------------+
Truncated to displaylimit of 10.

**Advanced example**

Step 1: Rank products by total sales within each month

In [4]:
%%sql

SELECT pd.productname AS product_name,
       EXTRACT(MONTH FROM sl.orderdate) AS month,
       SUM((sl.quantity * sl.unitprice)) AS total_sales,
       ROW_NUMBER() OVER (PARTITION BY EXTRACT(MONTH FROM sl.orderdate) ORDER BY SUM((sl.quantity * sl.unitprice)) DESC) AS product_rank
FROM sales sl
LEFT JOIN product pd ON sl.productkey = pd.productkey
GROUP BY product_name, month
ORDER BY 
    month, 
    product_rank
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

27189 rows affected.

+---------------------------------------------+-------+-------------+--------------+
|                 product_name                | month | total_sales | product_rank |
+---------------------------------------------+-------+-------------+--------------+
|      Contoso Projector 1080p X981 White     |   1   |   254898.0  |      1       |
|  Adventure Works Desktop PC2.33 XD233 Black |   1   |   209304.0  |      2       |
|        WWI Desktop PC2.33 X2330 Brown       |   1   |   193909.0  |      3       |
|       WWI Desktop PC2.33 X2330 Silver       |   1   |   188395.0  |      4       |
|   Adventure Works 52" LCD HDTV X590 Black   |   1   | 186904.3555 |      5       |
|        WWI Desktop PC2.33 X2330 White       |   1   |   167717.5  |      6       |
|        WWI Desktop PC2.33 X2330 Black       |   1   |   167258.0  |      7       |
| Adventure Works Desktop PC2.33 XD233 Silver |   1   |   165699.0  |      8       |
|  Adventure Works Desktop PC2.33 XD233 White |   1   |   151164.0  |      9       |
|  Adventure Works Desktop PC2.33 XD233 Brown |   1   |   146319.0  |      10      |
+---------------------------------------------+-------+-------------+--------------+
Truncated to displaylimit of 10.

Step 2: Only get top 5 products

In [5]:
%%sql

WITH ranked_products AS (
    SELECT pd.productname AS product_name,
           EXTRACT(MONTH FROM sl.orderdate) AS month,
           SUM(sl.quantity * sl.unitprice) AS total_sales,
           ROW_NUMBER() OVER (PARTITION BY EXTRACT(MONTH FROM sl.orderdate) ORDER BY SUM(sl.quantity * sl.unitprice) DESC) AS product_rank
    FROM sales sl
    LEFT JOIN product pd ON sl.productkey = pd.productkey
    GROUP BY pd.productname, EXTRACT(MONTH FROM sl.orderdate)
)

SELECT 
    product_name, 
    month, total_sales, product_rank
FROM ranked_products
WHERE product_rank <= 5
ORDER BY month, product_rank;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

60 rows affected.

+---------------------------------------------+-------+-------------+--------------+
|                 product_name                | month | total_sales | product_rank |
+---------------------------------------------+-------+-------------+--------------+
|      Contoso Projector 1080p X981 White     |   1   |   254898.0  |      1       |
|  Adventure Works Desktop PC2.33 XD233 Black |   1   |   209304.0  |      2       |
|        WWI Desktop PC2.33 X2330 Brown       |   1   |   193909.0  |      3       |
|       WWI Desktop PC2.33 X2330 Silver       |   1   |   188395.0  |      4       |
|   Adventure Works 52" LCD HDTV X590 Black   |   1   | 186904.3555 |      5       |
|        WWI Desktop PC2.33 X2330 Brown       |   2   |   267888.5  |      1       |
|  Adventure Works Desktop PC2.33 XD233 Brown |   2   |   248064.0  |      2       |
|  Adventure Works Desktop PC2.33 XD233 Black |   2   |   240796.5  |      3       |
|        WWI Desktop PC2.33 X2330 Black       |   2   |   234804.5  |      4       |
| Adventure Works Desktop PC2.33 XD233 Silver |   2   |   229168.5  |      5       |
+---------------------------------------------+-------+-------------+--------------+
Truncated to displaylimit of 10.

### üìù¬†Notes

- `RANK()`: Assigns the same rank to rows with identical values but skips ranks after ties (e.g., 1, 2, 2, 4).
- `DENSE_RANK()`: Similar to RANK(), it assigns the same rank to rows with identical values but does not skip ranks after ties (e.g., 1, 2, 2, 3).

### üíª¬†Final Result

- Describe what the final result should be e.g. return the retention by X cohort.

#### Problem Description

**`FUNCTION` / Concept Covered**

1. Go into specific step / what we‚Äôre going to do. E.g. Use the `=` operator to set a new column to be equal to Experience

Write using `RANK()`:

In [6]:
%%sql

WITH ranked_products AS (
    SELECT pd.productname AS product_name,
           EXTRACT(MONTH FROM sl.orderdate) AS month,
           SUM(sl.quantity * sl.unitprice) AS total_sales,
           RANK() OVER (PARTITION BY EXTRACT(MONTH FROM sl.orderdate) ORDER BY SUM(sl.quantity * sl.unitprice) DESC) AS product_rank
    FROM sales sl
    LEFT JOIN product pd ON sl.productkey = pd.productkey
    GROUP BY pd.productname, EXTRACT(MONTH FROM sl.orderdate)
)

SELECT 
    product_name, 
    month, total_sales, product_rank
FROM ranked_products
WHERE product_rank <= 5
ORDER BY month, product_rank;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

60 rows affected.

+---------------------------------------------+-------+-------------+--------------+
|                 product_name                | month | total_sales | product_rank |
+---------------------------------------------+-------+-------------+--------------+
|      Contoso Projector 1080p X981 White     |   1   |   254898.0  |      1       |
|  Adventure Works Desktop PC2.33 XD233 Black |   1   |   209304.0  |      2       |
|        WWI Desktop PC2.33 X2330 Brown       |   1   |   193909.0  |      3       |
|       WWI Desktop PC2.33 X2330 Silver       |   1   |   188395.0  |      4       |
|   Adventure Works 52" LCD HDTV X590 Black   |   1   | 186904.3555 |      5       |
|        WWI Desktop PC2.33 X2330 Brown       |   2   |   267888.5  |      1       |
|  Adventure Works Desktop PC2.33 XD233 Brown |   2   |   248064.0  |      2       |
|  Adventure Works Desktop PC2.33 XD233 Black |   2   |   240796.5  |      3       |
|        WWI Desktop PC2.33 X2330 Black       |   2   |   234804.5  |      4       |
| Adventure Works Desktop PC2.33 XD233 Silver |   2   |   229168.5  |      5       |
+---------------------------------------------+-------+-------------+--------------+
Truncated to displaylimit of 10.

Write using `DENSE_RANK()`

In [7]:
%%sql

WITH ranked_products AS (
    SELECT pd.productname AS product_name,
           EXTRACT(MONTH FROM sl.orderdate) AS month,
           SUM(sl.quantity * sl.unitprice) AS total_sales,
           RANK() OVER (PARTITION BY EXTRACT(MONTH FROM sl.orderdate) ORDER BY SUM(sl.quantity * sl.unitprice) DESC) AS product_rank
    FROM sales sl
    LEFT JOIN product pd ON sl.productkey = pd.productkey
    GROUP BY pd.productname, EXTRACT(MONTH FROM sl.orderdate)
)

SELECT 
    product_name, 
    month, total_sales, product_rank
FROM ranked_products
WHERE product_rank <= 5
ORDER BY month, product_rank;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

60 rows affected.

+---------------------------------------------+-------+-------------+--------------+
|                 product_name                | month | total_sales | product_rank |
+---------------------------------------------+-------+-------------+--------------+
|      Contoso Projector 1080p X981 White     |   1   |   254898.0  |      1       |
|  Adventure Works Desktop PC2.33 XD233 Black |   1   |   209304.0  |      2       |
|        WWI Desktop PC2.33 X2330 Brown       |   1   |   193909.0  |      3       |
|       WWI Desktop PC2.33 X2330 Silver       |   1   |   188395.0  |      4       |
|   Adventure Works 52" LCD HDTV X590 Black   |   1   | 186904.3555 |      5       |
|        WWI Desktop PC2.33 X2330 Brown       |   2   |   267888.5  |      1       |
|  Adventure Works Desktop PC2.33 XD233 Brown |   2   |   248064.0  |      2       |
|  Adventure Works Desktop PC2.33 XD233 Black |   2   |   240796.5  |      3       |
|        WWI Desktop PC2.33 X2330 Black       |   2   |   234804.5  |      4       |
| Adventure Works Desktop PC2.33 XD233 Silver |   2   |   229168.5  |      5       |
+---------------------------------------------+-------+-------------+--------------+
Truncated to displaylimit of 10.

What's the difference between `ROW_NUMBER()`, `RANK()`, `DENSE_RANK()`

1. `ROW_NUMBER()` 
    - Even if two rows have the same value, they will get different, consecutive ranks.
    - Example: If three products have the same sales amount, they‚Äôll be ranked 1, 2, and 3 in sequence.

    | Sales | ROW_NUMBER() |
    |-------|--------------|
    | 500   | 1            |
    | 500   | 2            |
    | 400   | 3            |
    | 300   | 4            |


2. `RANK()`
    - Rows with identical values receive the same rank, and the next rank jumps to the next number in sequence.
    - Example: If three products have the same highest sales amount, they all get rank 1, and the next product will get rank 4.

    | Sales | ROW_NUMBER() |
    |-------|--------------|
    | 500   | 1            |
    | 500   | 1            |
    | 400   | 3            |
    | 300   | 4            |


3. `DENSE_RANK()`
    - Rows with identical values receive the same rank, and the next rank continues sequentially without gaps.
    - Example: If three products have the same highest sales amount, they all get rank 1, and the next product will get rank 2.

    | Sales | ROW_NUMBER() |
    |-------|--------------|
    | 500   | 1            |
    | 500   | 1            |
    | 400   | 2            |
    | 300   | 3            |

**Alternative note format**

- Same info as above but in a different format. 

| Function     | Description                                                                                    | Tie Handling                           | Example Sales Values (500, 500, 400, 300) |
|--------------|------------------------------------------------------------------------------------------------|----------------------------------------|-------------------------------------------------------|
| ROW_NUMBER() | Assigns a unique, sequential rank   to each row without regard for ties.                       | No ties; each row gets a unique   rank | 1, 2, 3, 4                                            |
| RANK()       | Assigns the same rank to   identical values but skips ranks after ties.                        | Same rank for ties; skips next   ranks | 1, 1, 3, 4                                            |
| DENSE_RANK() | Assigns the same rank to   identical values but continues sequentially without skipping ranks. | Same rank for ties; no skipped   ranks | 1, 1, 2, 3                                            |